import * as yup from "yup";

const validationSchema = yup.object().shape({
  name: yup
    .string()
    .typeError("Має бути рядком")
    .min(3, "Занадто коротке ім'я. Ім'я має містити від 3 до 100 символів")
    .max(100, "Занадто довге ім'я. Ім'я має містити від 3 до 100 символів")
    .matches(
      /^[^\s~!@#$%^&*()][\w\d\s!А-Яа-я@#$%^&*()]{3,100}$/,
      "Ім'я має бути валідним"
    )
    .required("Це поле обов'язкове"),
  numberPhone: yup
    .string()
    .matches(
      /^((3)8)((0\(\d{2}\)?)|(\(0\d{2}\))|(0\d{2}))\d{7}$/,
      "Номер повинен починатись 380"
    )
    .required("Це поле обов'язкове"),
  email: yup
    .string()
    .min(10, "Занадто короткий Email. Email має містити від 10 до 63 символів")
    .max(63, "Занадто довгий Email. Email має містити від 3 до 63 символів")
    .matches(
      /^[^-.#!?,%$&^*()][\w-.#!?,%$&^*()]+[^-.#!?,%$&^*()]@([\w-]+\.)+[\w-.][^-.,!?#$]{1,4}$/,
      "Email має бути валідним"
    )
    .required("Це поле обов'язкове"),
  service: yup.string().min(3, "не менше 3 символів"),

  message: yup
    .string()
    .min(3, "не менше 3 символів")
    .required("Це поле обов'язкове"),
});

export default validationSchema;
